package main

// Підключення пакету fmt (format) та time.
//fmt відповідає за ввід та вивід
//time відповідає за обробку часу
import (
	"fmt"
	"time"
)

// Точка входу програми.
func main() {
	// Тут виконується основний код програми.
	// Отримання поточного часу з системи пристрою.
	currentTime := time.Now()

	// Виведення текстового повідомлення у консоль.
	// Формат дати в Go задається зразком "02.01.2006 15:04:05".
	fmt.Printf("Welcome to our app! Today is %s\n", currentTime.Format("02.01.2006 15:04:05"))
}
